package s03_04;

/**
 * 배열 (Array)
 * 배열은 특정한 자료형의 메모리가 연속적으로 나열된 형태의 자료 구조이다.
 * 배열을 선언할 때 지정한 자료형과 개수만큼 메모리 공간을 할당한다.
 * ⚠ 컴파일 언어 특성상 한 번 선언된 배열은 길이를 변경할 수 없다.
 */

public class L04_01 {
    public static void main(String[] args) {
        // 배열의 선언
        // 배열을 선언할 때 자료형은 배열 요소가 될 자료형 뒤에 []가 붙은 자료형[]를 사용한다.
        byte[] arrByte;
        // 해당 자료형은 메모리 주소를 저장하는 참조형(Reference type)이다.
        // 즉, 배열 변수는 배열 요소의 메모리 주소를 저장하는 참조형 변수이다.
        // 배열을 선언만 한 경우 배열의 주소를 저장할 변수의 메모리만 할당된 상태이다.
    }
}
